/*! \mainpage Scalable Vector Graphics
 *
 * \section Introduction
 * - Проект по ООП за КН курс 1 семестър 2 2019/2020г.
 * \section About The Program
 * Програмата дава възможност на потребител да зарежда и редактира всякакви файлове 
 * съдържащи структурата SVG в себе си, позволява създаването на нови фигури, 
 * промяна на разположението им в развнината(прозореца), изтриването им и други
 * интересни функции. Програмата дава възможност и за промяна на фигурите и запазването им
 * в реално време. 
 * \section Improvements
 * - Поддържане на повече фигури.
 * - Поддържане на обекти от тип "група" за по-специфично съхранение на фигурите.
 * - Проверки за правилното въвеждане на информацията от потребителя.
 * - Подобрение на текущите обекти съдържащи точки от равнината в себе си, като се добави нов клас "Point". 
 * \section Sources
 * - [GitHub]: https://github.com/Stuksi
 * - [Project Repository]: https://github.com/Stuksi/OOP-Projects
 * \author Стоян Грозданов  курс:1, поток:1, група:2
 * \date 31.05.2020
 * \bug Не се разпознават грешни входове в системата.
 * \warning Неправилни входове в системата ще доведат до прекратяване(крашване) на програмата.
 *
 */